Revit 2027 API
CurveUV.ComputeDerivatives Method
 Computes the first derivative, the second derivative and the unit tangent vector at the specified parameter along the curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<UV> ComputeDerivatives(
	double parameter,
	bool normalized
)
Public Function ComputeDerivatives (
	parameter As Double,
	normalized As Boolean
) As IList(Of UV)
public:
IList<UV^>^ ComputeDerivatives(
	double parameter,
	bool normalized
)
member ComputeDerivatives :
        parameter : float *
        normalized : bool -> IList<UV>
Parameters
parameter Double
 The specified parameter along the curve.
normalized Boolean
 If false, parameter is interpreted as natural parameterization of the curve. If true, param is expected to be in [0,1] interval mapped to the bounds of the curve. Setting to true is valid only if the curve is bound.
Return Value
IList<UV>
 The array containing three members: the first derivative (at index [0]), the second derivative (at index [1]) and the unit tangent vector (at index [2]).
Exceptions
Exception | Condition
ArgumentException |  The given value for parameter is not finite
ArgumentOutOfRangeException |  The curve cannot be evaluated as normalized because it is unbound. -or- The parameter is not a valid value for normalized evaluation.
See Also
Reference
CurveUV Class
Autodesk.Revit.DB Namespace